snlkuharlocal/src/DataProcessors/МП_ММ_ЯндексМаркет/МП_ММ_ЯндексМаркет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МП_ММ_ЯндексМаркет</name>
  <attributes>
    <name>МаркетПлейс</name>
    <type>
      <types>CatalogRef.ИнетМагазины</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗаказов</name>
    <attributes>
      <name>created_at</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>order_id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>status</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>cutoff_time</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/МП_ДанныеЗаказовСервиса/МП_ДанныеЗаказовСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_ДанныеЗаказовСервиса</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Интервал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаказПоЮрЛицу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВнешнийИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МаркетПлейс</name>
    <type>
      <types>CatalogRef.ИнетМагазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ЗаказКлиентаFBS</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/МП_ДанныеНоменклатурыЗаказовСервиса/МП_ДанныеНоменклатурыЗаказовСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_ДанныеНоменклатурыЗаказовСервиса</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтикеткаСформирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПосылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеУКлиента</name>
    <type>
      <types>CatalogRef.СостояниеНакладнойУКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКЭтикетке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВнешнийИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МаркетПлейс</name>
    <type>
      <types>CatalogRef.ИнетМагазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШККонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ЗаказКлиентаFBS/ЗаказКлиентаFBS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиентаFBS</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистПереукладки</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РИД</name>
      <comment>идентификатор вайлдб. для обмена.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусWB</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеУКлиента</name>
      <type>
        <types>CatalogRef.СостояниеНакладнойУКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаОтработана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогистСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркОфис</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереданоНаСайт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/МП_ММ_ЯндексМаркет/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура - МП Обработать загрузку закзов порционно
// 
// Параметры:
//  ПараметрыОбработки - Структура - Параметры обработки данных сервиса Магнит Маркет
//  РезультатыЗапроса - Массив из РезультатЗапроса - Результаты запроса для выборки данных
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура МП_ОбработатьЗагрузкуЗаказовПорционно(ПараметрыОбработки, РезультатыЗапроса, РеквизитыМаркетПлейс) Экспорт
	
	// Инициализация
	ПараметрыОтбора = Новый Структура;
	
	НаборЗаписейДанныеЗаказов = ОбменМаркетПлейс.ПолучитьДанныеНабораРегистраСведенийПоДаннымМаркетплейса(
		ПараметрыОбработки.МаркетПлейс, "МП_ДанныеЗаказовСервиса",
		РезультатыЗапроса[РезультатыЗапроса.ВГраница() - 1]);
	НаборЗаписейДанныеТоваров = ОбменМаркетПлейс.ПолучитьДанныеНабораРегистраСведенийПоДаннымМаркетплейса(
		ПараметрыОбработки.МаркетПлейс, "МП_ДанныеНоменклатурыЗаказовСервиса",
		РезультатыЗапроса[РезультатыЗапроса.ВГраница()]);
	
	СмещениеПакетаЗапроса_ДанныеЗаказов = 5;
	Выборка = РезультатыЗапроса[СмещениеПакетаЗапроса_ДанныеЗаказов - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПараметрыОбработки.ДополнительныеПараметры.ПараметрыЗапроса = Новый Структура;
	ПараметрыОбработки.ДополнительныеПараметры.ПараметрыЗапроса.Вставить("limit", 50);
	ПараметрыОбработки.ДополнительныеПараметры.ПараметрыЗапроса.Вставить("page_token", "");
	
	ПараметрыОбработки.ДополнительныеПараметры.Json = Новый Структура;
	ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("programTypes", Новый Массив);
	ПараметрыОбработки.ДополнительныеПараметры.Json.programTypes.Добавить("FBS");
	ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("campaignIds", Новый Массив);
	ПараметрыОбработки.ДополнительныеПараметры.Json.campaignIds.Добавить(РеквизитыМаркетПлейс.ИДКомпании);
	ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("dates", Новый Структура);
	ПараметрыОбработки.ДополнительныеПараметры.Json.dates.Вставить("creationDateFrom",
		Формат(ПараметрыОбработки.ДатаНачала, "ДФ=yyyy-MM-dd"));
	ПараметрыОбработки.ДополнительныеПараметры.Json.dates.Вставить("creationDateTo",
		Формат(ПараметрыОбработки.ДатаОкончания + 86400, "ДФ=yyyy-MM-dd"));
	ПараметрыОбработки.ДополнительныеПараметры.Json.Вставить("fake", Ложь);
	
	Пока Истина Цикл
		СтруктураДанныхОтвета = КоннекторHTTP.Post(СтрШаблон("https://%1%2", РеквизитыМаркетПлейс.Host,
				МП_АдресЗапроса_СписокЗаказов(РеквизитыМаркетПлейс.WarehouseId)),,
					ПараметрыОбработки.ДополнительныеПараметры);
		ДанныеОтвета = КоннекторHTTP.КакJson(СтруктураДанныхОтвета,
			ПараметрыОбработки.ДополнительныеПараметры.ПараметрыПреобразованияJSON);
		// Обработка ошибок со стороны сервиса
		Если Не СтруктураДанныхОтвета.Свойство("КодСостояния")
			Или СтруктураДанныхОтвета.КодСостояния > 400 Тогда
			ВызватьИсключение "Ошибка получения данных по заказам";
		КонецЕсли;
		
		// Проверяем на наличие заказа и соответствующе обрабатываем.
		// Если заказа в наличии нет, то создаем его.
		МассивЗаказов = ДанныеОтвета[ПараметрыОбработки.ИменаСтруктурДанных.ТелоЗаказа];
		ДанныеПосылокПоЗаказам = ПолучитьПосылкиПоНомерамЗаказов(МассивЗаказов, ПараметрыОбработки);
		Для каждого ДанныеЗаказа из МассивЗаказов Цикл
			ПараметрыОбработки.АгрегируемыеПоля.Сумма = 0;
			
			// Ихсанов Д. А. Начало 18.06.2026 Изменение 0000000070 от 05.06.2026 10:46:32: e1cib/data/Документ.Изменение?ref=89690050568f680711f160b2a681657e
			ДатаПриемки = ДанныеЗаказа[ПараметрыОбработки.ИменаПолей.ДатаСоздания] + 12 * 60 * 60;
			ПараметрыОбработки.АгрегируемыеПоля.Интервал = ОбменМаркетПлейс.ПолучитьВремяПриемкиИзДатыЗагрузки(
				ДеньНедели(ДатаПриемки), Час(ДатаПриемки), ДатаПриемки);
			// Ихсанов Д. А. Конец 18.06.2026
			
			ДвижениеДанныеЗаказов = НаборЗаписейДанныеЗаказов.Добавить();
			ДвижениеДанныеЗаказов.Период	  = Выборка.ДатаСоздания;
			ДвижениеДанныеЗаказов.МаркетПлейс = ПараметрыОбработки.МаркетПлейс;
			
			// Проверяем существуют ли данные в базе, если существуют, то модифицируем их, если нет, создаем новые
			ПараметрыОтбора.Очистить();
			ПараметрыОтбора.Вставить("ВнешнийИдентификатор",
				Строка(ДанныеЗаказа[ПараметрыОбработки.ИменаПолей.ВнешнийИдентификатор]));
			Если Выборка.НайтиСледующий(ПараметрыОтбора) Тогда
				ЗаполнитьЗначенияСвойств(ДвижениеДанныеЗаказов, Выборка);
			КонецЕсли;
			
			ДанныеПосылки = ДанныеПосылокПоЗаказам[ДанныеЗаказа[ПараметрыОбработки.ИменаПолей.ВнешнийИдентификатор]];
			
			ОбменМаркетПлейс.ЗаполнитьПоляКоллекцииПоВложенности(ПараметрыОбработки.ИменаПолей, ДанныеЗаказа,
				ДвижениеДанныеЗаказов);
			
			ВыборкаИдентификаторыЗаказа = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			МассивТоваров = ДанныеЗаказа[ПараметрыОбработки.ИменаСтруктурДанных.Товары];
			СмещениеПоТовару = 1;
			Для каждого Товар из МассивТоваров Цикл
				ПараметрыОтбора.Очистить();
				ПараметрыОтбора.Вставить("Идентификатор",
					Формат(Товар[ПараметрыОбработки.ИменаПолейТоваров.Идентификатор], "ЧГ="));
				
				ВыборкаИдентификаторыЗаказа.НайтиСледующий(ПараметрыОтбора);
				
				КоличествоОтмененных = 0;
				ВыборкаДетальныеЗаписи = ВыборкаИдентификаторыЗаказа.Выбрать();
				КоличествоТовара = Макс(Товар.count, ВыборкаДетальныеЗаписи.Количество());
				Для ИндексТовара = 1 по КоличествоТовара Цикл
					ДвижениеДанныеТоваров = НаборЗаписейДанныеТоваров.Добавить();
					ДвижениеДанныеТоваров.МаркетПлейс = ПараметрыОбработки.МаркетПлейс;
					
					ЭкземплярТовараОтменен = Ложь;
					Если ВыборкаДетальныеЗаписи.НайтиСледующий(ПараметрыОтбора) Тогда
						ЗаполнитьЗначенияСвойств(ДвижениеДанныеТоваров, ВыборкаДетальныеЗаписи);
						
						ЭкземплярТовараОтменен = ВыборкаДетальныеЗаписи.Отменен
					КонецЕсли;
					
					НомерОтгрузки = ""; НомерПосылки = ""; ШтрихКод = "";
					Если ДанныеПосылки <> Неопределено И Не ЭкземплярТовараОтменен Тогда
						ДанныеЭкземпляраПосылки =
							ДанныеПосылки[Формат(Товар[ПараметрыОбработки.ИменаПолейТоваров.Идентификатор], "ЧГ=")];
						Если ДанныеЭкземпляраПосылки <> Неопределено Тогда
							Для каждого ЭлементЭкземпляраПосылки из ДанныеЭкземпляраПосылки Цикл
								ДанныеЭкземпляраТовара = ЭлементЭкземпляраПосылки.Значение;
								НомерОтгрузки = ДанныеЭкземпляраТовара.shipmentId;
								НомерПосылки  = ДанныеЭкземпляраТовара.boxId;
								ШтрихКод	  = ДанныеЭкземпляраТовара.barcode;
								
								ДанныеЭкземпляраПосылки.Удалить(ЭлементЭкземпляраПосылки.Ключ);
								
								Прервать;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
					
					ОбменМаркетПлейс.ЗаполнитьПоляКоллекцииПоВложенности(ПараметрыОбработки.ИменаПолейТоваров, Товар,
						ДвижениеДанныеТоваров);
					ОбменМаркетПлейс.ЗаполнитьПоляКоллекцииПоВложенности(ПараметрыОбработки.ПоляТовараИзДанныхЗаказа,
						ДанныеЗаказа, ДвижениеДанныеТоваров);
					
					ПараметрыОбработки.АгрегируемыеПоляТовара.НомерЗаказа = СтрШаблон("%1-%2",
						ДанныеЗаказа[ПараметрыОбработки.ИменаПолей.ВнешнийИдентификатор],
						СмещениеПоТовару);
					ПараметрыОбработки.АгрегируемыеПоляТовара.НомерПосылки = НомерПосылки;
					ПараметрыОбработки.АгрегируемыеПоляТовара.ШтрихКод = ШтрихКод;
					ПараметрыОбработки.АгрегируемыеПоляТовара.НомерОтгрузки = НомерОтгрузки;
					ПараметрыОбработки.АгрегируемыеПоляТовара.Количество = 1;
					
					Если Товар.prices.Свойство("payment") Тогда
						ПараметрыОбработки.АгрегируемыеПоля.Сумма =
							ПараметрыОбработки.АгрегируемыеПоля.Сумма + Товар.prices.payment.value;
						ПараметрыОбработки.АгрегируемыеПоляТовара.Цена =
							Товар.prices.payment.value / ?(Товар.count = 0, 1, Товар.count);
					КонецЕсли;
					
					ПараметрыОбработки.АгрегируемыеПоля.ЗаказПоЮрЛицу = (ДанныеЗаказа.buyerType = "BUSINESS");
					
					// Проконтролируем частичную отмену товара
					Если ИндексТовара > Товар.count + КоличествоОтмененных
						И ДвижениеДанныеТоваров.Статус <> "CANCELLED" Тогда
						ПараметрыОбработки.АгрегируемыеПоляТовара.ДополнительныйСтатус = "CANCELLED";
						ПараметрыОбработки.АгрегируемыеПоляТовара.СостояниеУКлиента =
							ПараметрыОбработки.ХешТаблицаСтатусов["CANCELLED;CUSTOM"];
					ИначеЕсли ЭкземплярТовараОтменен
						И ДвижениеДанныеТоваров.Статус <> "CANCELLED" Тогда
						ПараметрыОбработки.АгрегируемыеПоляТовара.ДополнительныйСтатус = "CANCELLED";
						ПараметрыОбработки.АгрегируемыеПоляТовара.СостояниеУКлиента =
							ПараметрыОбработки.ХешТаблицаСтатусов["CANCELLED;CUSTOM"];
						
						КоличествоОтмененных = КоличествоОтмененных + 1;
					Иначе
						ПараметрыОбработки.АгрегируемыеПоляТовара.ДополнительныйСтатус =
							ДвижениеДанныеТоваров.ДополнительныйСтатус;
						ПараметрыОбработки.АгрегируемыеПоляТовара.СостояниеУКлиента	=
							ПараметрыОбработки.ХешТаблицаСтатусов[СтрШаблон("%1;%2",
								ДвижениеДанныеТоваров.Статус, ДвижениеДанныеТоваров.ДополнительныйСтатус)];
					КонецЕсли;
					
					Для каждого пПолеТовара из ПараметрыОбработки.АгрегируемыеПоляТовара Цикл
						ДвижениеДанныеТоваров[пПолеТовара.Ключ] = пПолеТовара.Значение;
					КонецЦикла;
					
					СмещениеПоТовару = СмещениеПоТовару + 1
				КонецЦикла;
				
				ВыборкаДетальныеЗаписи.Сбросить()
			КонецЦикла;
			
			Для каждого пПолеЗаказа из ПараметрыОбработки.АгрегируемыеПоля Цикл
				ДвижениеДанныеЗаказов[пПолеЗаказа.Ключ] = пПолеЗаказа.Значение;
			КонецЦикла;
			
			Выборка.Сбросить();
		КонецЦикла;
		
		Если ДанныеОтвета.Свойство("paging")
			И ДанныеОтвета.paging.Свойство("nextPageToken") Тогда
			ПараметрыОбработки.ДополнительныеПараметры.ПараметрыЗапроса.page_token = ДанныеОтвета.paging.nextPageToken;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Очень редко возникают ситуации, когда необходимо контролировать уникальность записей товаров по заказам
	// Таблица позволяет это сделать, так как у товаров есть количественное поле, а значит её можно свернуть
	ОбменМаркетПлейс.ВыполнитьГруппировкуЗаписейПоНабору(НаборЗаписейДанныеЗаказов, "Сумма");
	ОбменМаркетПлейс.ВыполнитьГруппировкуЗаписейПоНабору(НаборЗаписейДанныеТоваров, "Количество");
	
	Попытка
		// Сохраним данные о товарах к заказу на стороне сервиса
		НаборЗаписейДанныеЗаказов.Записать();
		НаборЗаписейДанныеТоваров.Записать();
	Исключение
		ЗаписатьВЛог("МП_ЯндексМаркет", СтрШаблон("Не была записана информация по заказам по причине: %1", 
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())), "Ошибка", Истина);
	КонецПопытки;
	
КонецПроцедуры // МП_ОбработатьЗагрузкуЗакзовПорционно()

// Процедура - Создать документы заказов и накладных
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура параметров обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура СоздатьДокументыЗаказовИНакладных(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	ПараметрыОбработки.ПараметрыЗадания.Вставить("КритическиеОшибкиОзон", Новый Массив);
	
	// Сложим в массив коллекции номеров заказов после обработки
	ДанныеМассивовЗаказов = Новый Массив;
	
	ТекстОповещения = "";
	
	// Получаем данные по заказам, по которым нет документа заказ клиента FBS
	// Если нет заказа, то нет и расходной накладной
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЕСТЬNULL(ЗаказКлиентаFBSТовары.Ссылка, ПредварительныйЗаказКлиентаТовары.Ссылка) КАК Ссылка,
	|	&ТекущаяДата КАК ДатаСоздания,
	|	вт_СериализированныеДанныеЗаказов.ДатаОтгрузки КАК ДатаОтгрузки,
	|	вт_СериализированныеДанныеЗаказов.НомерЗаказа КАК ИДЗаказа,
	|	0 КАК КолНеТовар,
	|	вт_СериализированныеДанныеЗаказов.ШтрихКод КАК ШтрихКод,
	|	вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор КАК РИД,
	|	вт_СериализированныеДанныеЗаказов.Номенклатура КАК Номенклатура,
	|	вт_СериализированныеДанныеЗаказов.Идентификатор КАК АртКонтра,
	|	вт_СериализированныеДанныеЗаказов.Цена КАК СуммаЗак,
	|	вт_СериализированныеДанныеЗаказов.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НомРП1,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НомРП2,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НомРП3,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НомРП4,
	|	вт_СериализированныеДанныеЗаказов.НомерОтгрузки КАК ПрефиксЗаказа,
	|	вт_СериализированныеДанныеЗаказов.НомерПосылки КАК СуффиксЗаказа,
	|	вт_СериализированныеДанныеЗаказов.СостояниеУКлиента КАК СостояниеУКлиента,
	|	вт_СериализированныеДанныеЗаказов.ЗаказПоЮрЛицу КАК ЗаказПоЮрЛицу,
	|	0 КАК НДС,
	|	0 КАК Всего,
	|	ЕСТЬNULL(вт_СериализированныеДанныеЗаказов.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ПОМЕСТИТЬ вт_ДанныеДляФормированияДокументов
	|ИЗ
	|	вт_СериализированныеДанныеЗаказов КАК вт_СериализированныеДанныеЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|		ПО вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор = ЗаказКлиентаFBSТовары.РИД
	|			И (НЕ ЗаказКлиентаFBSТовары.Ссылка.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительныйЗаказКлиента.Товары КАК ПредварительныйЗаказКлиентаТовары
	|		ПО вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор = ПредварительныйЗаказКлиентаТовары.РИД
	|			И (НЕ ПредварительныйЗаказКлиентаТовары.Ссылка.ПометкаУдаления)
	|ГДЕ
	|	ЗаказКлиентаFBSТовары.Ссылка ЕСТЬ NULL
	|	И ПредварительныйЗаказКлиентаТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДанныеДляФормированияДокументов.РИД КАК РИД,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_ДанныеДляФормированияДокументов.ИДЗаказа) КАК КоличествоЭкземпляров
	|ПОМЕСТИТЬ вт_КоличествоЭкзепляровНаЗаказ
	|ИЗ
	|	вт_ДанныеДляФормированияДокументов КАК вт_ДанныеДляФормированияДокументов
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_ДанныеДляФормированияДокументов.РИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДанныеДляФормированияДокументов.*,
	|	вт_КоличествоЭкзепляровНаЗаказ.КоличествоЭкземпляров
	|ИЗ
	|	вт_ДанныеДляФормированияДокументов КАК вт_ДанныеДляФормированияДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_КоличествоЭкзепляровНаЗаказ КАК вт_КоличествоЭкзепляровНаЗаказ
	|		ПО вт_ДанныеДляФормированияДокументов.РИД = вт_КоличествоЭкзепляровНаЗаказ.РИД
	|ГДЕ
	|	вт_КоличествоЭкзепляровНаЗаказ.КоличествоЭкземпляров = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДанныеДляФормированияДокументов.*,
	|	вт_КоличествоЭкзепляровНаЗаказ.КоличествоЭкземпляров
	|ИЗ
	|	вт_ДанныеДляФормированияДокументов КАК вт_ДанныеДляФормированияДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_КоличествоЭкзепляровНаЗаказ КАК вт_КоличествоЭкзепляровНаЗаказ
	|		ПО вт_ДанныеДляФормированияДокументов.РИД = вт_КоличествоЭкзепляровНаЗаказ.РИД
	|ГДЕ
	|	вт_КоличествоЭкзепляровНаЗаказ.КоличествоЭкземпляров > 1");
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.МенеджерВременныхТаблиц = ПараметрыОбработки.МенеджерВременныхТаблиц;
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	Для Индекс = МассивРезультатовЗапроса.ВГраница() - 1 По МассивРезультатовЗапроса.ВГраница() Цикл
		РезультатЗапроса = МассивРезультатовЗапроса[Индекс];
		
		ТаблицаДанныхПоЗаказам = РезультатЗапроса.Выгрузить();
		
		ТаблицаДатыОтгрузки = ТаблицаДанныхПоЗаказам.Скопировать();
		ТаблицаДатыОтгрузки.Свернуть("ДатаОтгрузки");
		ТаблицаДатыОтгрузки.Сортировать("ДатаОтгрузки");
		
		Для каждого СтрокаДатыОтгрузки из ТаблицаДатыОтгрузки Цикл
			ОбменМаркетПлейс.ЯндексМаркет_ОбработатьСозданиеДокументовПоЗаказамПЗК(Справочники.ИнетМагазины.НайтиПоКоду("00004"),
				ТаблицаДанныхПоЗаказам, ПараметрыОбработки.ПараметрыЗадания, ДанныеМассивовЗаказов, СтрокаДатыОтгрузки.ДатаОтгрузки,
				ТекстОповещения);
		КонецЦикла;
	КонецЦикла;
	
	Если ПараметрыОбработки.МаркетПлейс.Тест Тогда
		СообщитьИзМодуля(ТекстОповещения);
		ЗаписатьВЛог("МП_ЯндексМаркет", "Окончание выполнения. Задача: Загрузка заказов Яндекс!", "Информация");
	КонецЕсли;
	
КонецПроцедуры // СоздатьДокументыЗаказовИНакладных()

// Процедура - Заполнить документы данными сервиса
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура с параметрами обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура ЗаполнитьДокументыДаннымиСервиса(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	// Ихсанов Д. А. Начало 23.06.2026 Изменение 0000000147 от 09.06.2026 7:50:49: e1cib/data/Документ.Изменение?ref=89690050568f680711f163bec84d8034
	Запрос = Новый Запрос(ОбменМаркетПлейс.ТекстЗапросаЗаполнитьДокументыДаннымиСервиса());
	// Ихсанов Д. А. Конец 23.06.2026
	Запрос.МенеджерВременныхТаблиц = ПараметрыОбработки.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СостояниеУКлиента", ПараметрыОбработки.ХешТаблицаСтатусов["CANCELLED;SHOP_FAILED"]);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ДокументОбъектЗаказКлиентаFBS = Выборка.Ссылка.ПолучитьОбъект();
		
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПараметрыОтбора = Новый Структура();
			ПараметрыОтбора.Вставить("НомерЗаказа", ВыборкаДетальныеЗаписи.НомерЗаказа);
			
			НайденныеСтроки = ДокументОбъектЗаказКлиентаFBS.Товары.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Для каждого СтрокаТабличнойЧасти из НайденныеСтроки Цикл
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыборкаДетальныеЗаписи)
				КонецЦикла
			КонецЕсли
		КонецЦикла;
		
		ДокументОбъектЗаказКлиентаFBS.Записать();
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДокументыДаннымиСервиса()

// Процедура - Привязать документы к заказам
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура с параметрами обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура ПривязатьДокументыКЗаказам(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ЗаказКлиентаFBSТовары.Ссылка ЕСТЬ NULL
	|				ТОГДА ЗаказКлиентаFBSТовары.Ссылка
	|			КОГДА НЕ ПредварительныйЗаказКлиентаТовары.Ссылка ЕСТЬ NULL
	|				ТОГДА ПредварительныйЗаказКлиентаТовары.Ссылка
	|			ИНАЧЕ вт_СериализированныеДанныеЗаказов.Документ
	|		КОНЕЦ) КАК Документ,
	|	МП_ДанныеЗаказовСервиса.МаркетПлейс КАК МаркетПлейс,
	|	вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор КАК ВнешнийИдентификатор,
	|	вт_СериализированныеДанныеЗаказов.ДатаСоздания КАК ДатаСоздания,
	|	вт_СериализированныеДанныеЗаказов.Сумма КАК Сумма,
	|	вт_СериализированныеДанныеЗаказов.ДатаОтгрузки КАК ДатаОтгрузки,
	|	вт_СериализированныеДанныеЗаказов.Интервал КАК Интервал,
	// Ихсанов Д. А. Начало 07.07.2026 Изменение 0000000087 от 07.06.2026 22:19:02: e1cib/data/Документ.Изменение?ref=89690050568f680711f162a5bd350d2d
	|	вт_СериализированныеДанныеЗаказов.ЗаказПоЮрЛицу КАК ЗаказПоЮрЛицу
	// Ихсанов Д. А. Конец 07.07.2026
	|ИЗ
	|	вт_СериализированныеДанныеЗаказов КАК вт_СериализированныеДанныеЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МП_ДанныеЗаказовСервиса КАК МП_ДанныеЗаказовСервиса
	|		ПО вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор = МП_ДанныеЗаказовСервиса.ВнешнийИдентификатор
	|			И (МП_ДанныеЗаказовСервиса.МаркетПлейс = &МаркетПлейс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|		ПО вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор = ЗаказКлиентаFBSТовары.РИД
	|			И (НЕ ЗаказКлиентаFBSТовары.Ссылка.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительныйЗаказКлиента.Товары КАК ПредварительныйЗаказКлиентаТовары
	|		ПО вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор = ПредварительныйЗаказКлиентаТовары.РИД
	|			И (НЕ ПредварительныйЗаказКлиентаТовары.Ссылка.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	МП_ДанныеЗаказовСервиса.МаркетПлейс,
	|	вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор,
	|	вт_СериализированныеДанныеЗаказов.ДатаСоздания,
	|	вт_СериализированныеДанныеЗаказов.Сумма,
	|	вт_СериализированныеДанныеЗаказов.ДатаОтгрузки,
	|	вт_СериализированныеДанныеЗаказов.Интервал,
	// Ихсанов Д. А. Начало 07.07.2026 Изменение 0000000087 от 07.06.2026 22:19:02: e1cib/data/Документ.Изменение?ref=89690050568f680711f162a5bd350d2d
	|	вт_СериализированныеДанныеЗаказов.ЗаказПоЮрЛицу");
	// Ихсанов Д. А. Конец 07.07.2026
	Запрос.МенеджерВременныхТаблиц = ПараметрыОбработки.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МаркетПлейс", ПараметрыОбработки.МаркетПлейс);
	
	НаборЗаписей = РегистрыСведений.МП_ДанныеЗаказовСервиса.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.МаркетПлейс.Установить(ПараметрыОбработки.МаркетПлейс);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры // ПривязатьДокументыКЗаказам()

// Процедура - Выполнить распределение товаров
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура параметров обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура ВыполнитьРаспределениеТоваров(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	МенеджерОбработкиПоПодготовкеЗаказов = Обработки.ЗаполнениеЗаказовФБСМаркиовкой;
	
	МассивСостоянийУКлиента = Новый Массив;
	МассивСостоянийУКлиента.Добавить(ПараметрыОбработки.ХешТаблицаСтатусов["PROCESSING;STARTED"]);
	
	// Получаем данные по товарам заказов
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить("ВЫБРАТЬ
	|	ЗаказКлиентаFBSТовары.Ссылка КАК ЗаказFBS,
	|	ЗаказКлиентаFBS.ДокОснование КАК РасходнаяНакладная,
	|	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа,
	|	ЗаказКлиентаFBSТовары.СуффиксЗаказа КАК СуффиксЗаказа,
	|	ЗаказКлиентаFBSТовары.РИД КАК НомерЗаказаВМоделиСервиса,
	|	вт_СериализированныеДанныеЗаказов.Идентификатор КАК АртикулКонтрагента,
	|	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКод,
	|	ЗаказКлиентаFBSТовары.Количество КАК Количество,
	|	ЗаказКлиентаFBSТовары.СостояниеУКлиента КАК СостояниеУКлиента,
	|	ЗаказКлиентаFBSТовары.ПрефиксЗаказа КАК ПрефиксЗаказа
	|ПОМЕСТИТЬ вт_ЗаказыНаРаспределение_Предварительная
	|ИЗ
	|	вт_СериализированныеДанныеЗаказов КАК вт_СериализированныеДанныеЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|		ПО вт_СериализированныеДанныеЗаказов.Документ = ЗаказКлиентаFBSТовары.Ссылка
	|			И вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор = ЗаказКлиентаFBSТовары.РИД
	|			И вт_СериализированныеДанныеЗаказов.НомерЗаказа = ЗаказКлиентаFBSТовары.НомерЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS КАК ЗаказКлиентаFBS
	|		ПО вт_СериализированныеДанныеЗаказов.Документ = ЗаказКлиентаFBS.Ссылка
	|ГДЕ
	|	вт_СериализированныеДанныеЗаказов.СостояниеУКлиента В(&СостоянияУКлиента)
	|	И ЗаказКлиентаFBSТовары.Ссылка <> ЗНАЧЕНИЕ(Документ.ЗаказКлиентаFBS.ПустаяСсылка);
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ЗаказыНаРаспределение_Предварительная.*,
	|	ДокументРасходнаяНакладная.СостояниеНакладной КАК СостояниеНакладной
	|ПОМЕСТИТЬ вт_ЗаказыНаРаспределение
	|ИЗ
	|	вт_ЗаказыНаРаспределение_Предварительная КАК вт_ЗаказыНаРаспределение_Предварительная
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК ДокументРасходнаяНакладная
	|		ПО вт_ЗаказыНаРаспределение_Предварительная.РасходнаяНакладная = ДокументРасходнаяНакладная.Ссылка
	|ГДЕ
	|	ДокументРасходнаяНакладная.Проведен
	|	И ДокументРасходнаяНакладная.СостояниеНакладной <> &СостояниеНакладной");
	ТекстыЗапросов.Добавить(МенеджерОбработкиПоПодготовкеЗаказов.МП_ЯндексМаркет_ТекстЗапросаДанныеМаркировкиЗаказов("вт_ЗаказыНаРаспределение"));
	ТекстыЗапросов.Добавить("ВЫБРАТЬ вт_Результат.*, вт_ЗаказыНаРаспределение.НомерЗаказа КАК НомерЗаказаВДокументе ИЗ вт_Результат
	|ЛЕВОЕ СОЕДИНЕНИЕ вт_ЗаказыНаРаспределение КАК вт_ЗаказыНаРаспределение
	|ПО вт_Результат.НомерЗаказа = вт_ЗаказыНаРаспределение.НомерЗаказаВМоделиСервиса
	|	И вт_Результат.Идентификатор = вт_ЗаказыНаРаспределение.АртикулКонтрагента
	|	И вт_Результат.НомерЗаказаСИндексом = вт_ЗаказыНаРаспределение.НомерЗаказаВМоделиСервиса
	|ИТОГИ МАКСИМУМ(вт_Результат.НомерЗаказа), МАКСИМУМ(вт_Результат.СуффиксЗаказа) ПО вт_Результат.ЗаказFBS, вт_Результат.НомерЗаказа, Идентификатор");
	
	Запрос = Новый Запрос(СтрСоединить(ТекстыЗапросов, ";"));
	Запрос.МенеджерВременныхТаблиц = ПараметрыОбработки.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СостоянияУКлиента",  МассивСостоянийУКлиента);
	Запрос.УстановитьПараметр("СостояниеНакладной", Перечисления.СостоянияНакладной.ВРаботе);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		// Формируем данные по коробкам для отправки
		ВыборкаНомераЗаказов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНомераЗаказов.Следующий() Цикл
			// Проверка статуса не нужна, идет постобработка заказов после создания документов
			// Получаем структуру, для перевода ее в формат JSON
			// А так же получаем необходимый для разбиения адрес эндпоинта
			ПараметрыОбработки.ДополнительныеПараметры.Json =
				МенеджерОбработкиПоПодготовкеЗаказов.МП_ЯндексМаркет_СформироватьСтруктуруДанныхПоВыборке(ВыборкаНомераЗаказов);
			
			ПараметрыОбработки.ДополнительныеПараметры.ПараметрыЗапроса.Очистить();
			СтруктураДанныхОтвета = КоннекторHTTP.Put(СтрШаблон("https://%1%2", РеквизитыМаркетПлейс.Host,
				МП_АдресЗапроса_СоздатьПосылку(РеквизитыМаркетПлейс.ИДКомпании, ВыборкаНомераЗаказов.НомерЗаказа)),,
				ПараметрыОбработки.ДополнительныеПараметры);
			ДанныеОтвета = КоннекторHTTP.КакJson(СтруктураДанныхОтвета,
				ПараметрыОбработки.ДополнительныеПараметры.ПараметрыПреобразованияJSON);
			// Обработка ошибок со стороны сервиса
			Если Не СтруктураДанныхОтвета.Свойство("КодСостояния")
				Или СтруктураДанныхОтвета.КодСостояния > 400 Тогда
				СообщитьИзМодуля("Возникла ошибка при создании посылки");
				
				Продолжить
			КонецЕсли;
			
			// Получаем и обрабатываем информацию о статусе заказа
			Если ДанныеОтвета.status = "OK"
				И СтруктураДанныхОтвета.КодСостояния = 200 Тогда
				ЗаказFBSОбъект = ВыборкаНомераЗаказов.ЗаказFBS.ПолучитьОбъект();
				
				Для каждого ДанныеУпаковки из ДанныеОтвета.result.boxes Цикл
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("РИД", ВыборкаНомераЗаказов.НомерЗаказа);
					ПараметрыОтбора.Вставить("СуффиксЗаказа", ДанныеУпаковки.boxId);
					
					НайденныеСтроки = ЗаказFBSОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
					Если НайденныеСтроки.Количество() > 0 Тогда
						Для каждого СтрокаТаблицыТоваров из НайденныеСтроки Цикл
							СтрокаТаблицыТоваров.СостояниеУКлиента = ПараметрыОбработки.ХешТаблицаСтатусов["PROCESSING;STARTED"];
						КонецЦикла
					КонецЕсли;
				КонецЦикла;
				
				Если Не ЗаказFBSОбъект.Модифицированность() Тогда
					Продолжить
				КонецЕсли;
				
				РежимЗаписи = РежимЗаписиДокумента.Запись;
				Если ЗаказFBSОбъект.Проведен Тогда
					РежимЗаписи = РежимЗаписиДокумента.Проведение;
				КонецЕсли;
				ЗаказFBSОбъект.Записать(РежимЗаписи);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьПервичноеРаспределениеТоваров()

// Процедура - Сформировать этикетки для посылок
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура параметров обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура СформироватьЭтикеткиДляПосылок(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	// Ихсанов Д. А. Начало 11.07.2026 Проблема 0000000210 от 10.07.2026 16:17:36: e1cib/data/Документ.Проблема?ref=896d0050568f680711f17c61b763e81a
	ДополнительныеПараметры = КоннекторHTTP.НовыеПараметры();
	ДополнительныеПараметры.Заголовки = ОбменМаркетПлейс.МП_Яндекс_ВернутьЗаголовкиHTTP(ПараметрыОбработки.МаркетПлейс);
	ДополнительныеПараметры.ПараметрыПреобразованияJSON.ПрочитатьВСоответствие = Ложь;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.МП_ДанныеНоменклатурыЗаказовСервиса КАК МП_ДанныеНоменклатурыЗаказовСервиса
	|ГДЕ
	|	НЕ МП_ДанныеНоменклатурыЗаказовСервиса.ЭтикеткаСформирована
	|	И МП_ДанныеНоменклатурыЗаказовСервиса.НомерПосылки <> """"
	|	И МП_ДанныеНоменклатурыЗаказовСервиса.МаркетПлейс = &МаркетПлейс
	|");
	Запрос.УстановитьПараметр("МаркетПлейс", ПараметрыОбработки.МаркетПлейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПолныйПутьКФайлуЭтикетки = Выборка.ПутьКЭтикетке;
		
		Файл = Новый Файл(ПолныйПутьКФайлуЭтикетки);
		Если Файл.Существует() И Файл.Размер() > 1000 Тогда
			МенеджерЗаписи = РегистрыСведений.МП_ДанныеНоменклатурыЗаказовСервиса.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.МаркетПлейс = ПараметрыОбработки.МаркетПлейс;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.ЭтикеткаСформирована = Истина;
				МенеджерЗаписи.ПутьКЭтикетке		= ПолныйПутьКФайлуЭтикетки;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
			Продолжить
		КонецЕсли;
		
		ПутьКПапкеСЭтикетками = РеквизитыМаркетПлейс.КаталогДляЭтикеток;
		Если Не ЗначениеЗаполнено(ПутьКПапкеСЭтикетками) Тогда
			ПутьКПапкеСЭтикетками = "\\srvfiles\1C_Logs_MarketPlace\";
		КонецЕсли;
		
		ПолныйПутьКФайлуЭтикетки = СтрШаблон("%1%2.pdf", ПутьКПапкеСЭтикетками, Выборка.НомерЗаказа);
		 
		Файл = Новый Файл(ПолныйПутьКФайлуЭтикетки);
		Если Файл.Существует() И Файл.Размер() > 1000 Тогда
			МенеджерЗаписи = РегистрыСведений.МП_ДанныеНоменклатурыЗаказовСервиса.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.МаркетПлейс = ПараметрыОбработки.МаркетПлейс;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.ЭтикеткаСформирована = Истина;
				МенеджерЗаписи.ПутьКЭтикетке		= ПолныйПутьКФайлуЭтикетки;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
			Продолжить
		КонецЕсли;
		
		СтруктураДанныхОтвета = КоннекторHTTP.Get(СтрШаблон("https://%1%2", РеквизитыМаркетПлейс.Host,
				МП_АдресЗапроса_Этикетки(РеквизитыМаркетПлейс.ИДКомпании, Выборка.ВнешнийИдентификатор,
				Выборка.НомерОтгрузки, Выборка.НомерПосылки)),, 
			ДополнительныеПараметры);
		ДанныеОтвета = КоннекторHTTP.КакДвоичныеДанные(СтруктураДанныхОтвета);
		// Обработка ошибок со стороны сервиса
		Если Не СтруктураДанныхОтвета.Свойство("КодСостояния")
			Или СтруктураДанныхОтвета.КодСостояния >= 400 Тогда
			СообщитьИзМодуля("Возникла ошибка при получении этикетки");
			
			Продолжить
		КонецЕсли;
		
		ДанныеОтвета.Записать(ПолныйПутьКФайлуЭтикетки);
		
		МенеджерЗаписи = РегистрыСведений.МП_ДанныеНоменклатурыЗаказовСервиса.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.МаркетПлейс = ПараметрыОбработки.МаркетПлейс;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.ЭтикеткаСформирована = Истина;
			МенеджерЗаписи.ПутьКЭтикетке		= ПолныйПутьКФайлуЭтикетки;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
	// Ихсанов Д. А. Конец 11.07.2026
	
КонецПроцедуры // СформироватьЭтикеткиДляПосылок()

// Процедура - Обработать отмену заказов
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура параметров обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура ОбработатьОтменуЗаказов(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	Запрос = Новый Запрос(ОбменМаркетПлейс.ТекстЗапросаДанныеДляОтменыДокументов());
	Запрос.МенеджерВременныхТаблиц = ПараметрыОбработки.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Статус",		 "CANCELLED");
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаказFBSОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", Выборка.Номенклатура);
		ПараметрыОтбора.Вставить("НомерЗаказа", Выборка.НомерЗаказа);
		
		НайденныеСтроки = ЗаказFBSОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для каждого СтрокаТаблицыТоваров из НайденныеСтроки Цикл
				СтрокаТаблицыТоваров.Количество		= 0;
				СтрокаТаблицыТоваров.Отменен		= Истина;
				СтрокаТаблицыТоваров.ПереданоНаСайт = Истина;
			КонецЦикла;
		КонецЕсли;
		
		Если Не ЗаказFBSОбъект.Модифицированность() Тогда
			Продолжить
		КонецЕсли;
		
		РежимЗаписи = РежимЗаписиДокумента.Запись;
		Если ЗаказFBSОбъект.Проведен Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		КонецЕсли;
		ЗаказFBSОбъект.Записать(РежимЗаписи);
	КонецЦикла;
	
	// ВРЕМЕННОЕ РЕШЕНИЕ ДЛЯ СОВМЕЩЕНИЯ СТАРОГО И НОВОГО ФУНКЦИОНАЛА
	ОбменМаркетПлейс.ЯндексМаркет_ОтправитьДанныеОбОтменахНаСайт(ПараметрыОбработки.Маркетплейс);
	
КонецПроцедуры // ОбработатьОтменуЗаказов()

// Процедура - Обработать подтверждение заказов
// 
// Параметры:
//  ПараметрыОбработки - Структура - Структура параметров обработки данных сервиса Яндекс Маркет
//  РеквизитыМаркетПлейс - Структура - Реквизиты маркетплейса
Процедура ОбработатьПодтверждениеЗаказов(ПараметрыОбработки, РеквизитыМаркетПлейс) Экспорт
	
	ДополнительныеПараметры = ПараметрыОбработки.ДополнительныеПараметры;
	
	// Ихсанов Д. А. 18.02.2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8924
	МассивСостояний = Новый Массив;
	СостоянияДокументаДляПодтверждения = ОбменМаркетПлейс.СостоянияДокументаДляПодтверждения();
	Для каждого КлючИЗначение из СостоянияДокументаДляПодтверждения Цикл
		МассивСостояний.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор КАК ВнешнийИдентификатор,
	|	КОЛИЧЕСТВО(вт_СериализированныеДанныеЗаказов.Номенклатура) КАК КоличествоТоваров,
	|	вт_СериализированныеДанныеЗаказов.Документ КАК Документ,
	|	вт_СериализированныеДанныеЗаказов.СостояниеНакладной КАК СостояниеНакладной
	|ПОМЕСТИТЬ вт_ДанныеПоНомерамЗаказовКПодтверждению
	|ИЗ
	|	вт_СериализированныеДанныеЗаказов КАК вт_СериализированныеДанныеЗаказов
	|ГДЕ
	|	вт_СериализированныеДанныеЗаказов.СостояниеУКлиента = &СостояниеУКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_СериализированныеДанныеЗаказов.ВнешнийИдентификатор,
	|	вт_СериализированныеДанныеЗаказов.Документ,
	|	вт_СериализированныеДанныеЗаказов.СостояниеНакладной
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДанныеПоНомерамЗаказовКПодтверждению.ВнешнийИдентификатор КАК ВнешнийИдентификатор
	|ИЗ
	|	вт_ДанныеПоНомерамЗаказовКПодтверждению КАК вт_ДанныеПоНомерамЗаказовКПодтверждению
	|ГДЕ
	|	вт_ДанныеПоНомерамЗаказовКПодтверждению.Документ <> НЕОПРЕДЕЛЕНО
	|	И вт_ДанныеПоНомерамЗаказовКПодтверждению.Документ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиентаFBS.ПустаяСсылка)
	|	И вт_ДанныеПоНомерамЗаказовКПодтверждению.Документ <> ЗНАЧЕНИЕ(Документ.ПредварительныйЗаказКлиента.ПустаяСсылка)
	|	И вт_ДанныеПоНомерамЗаказовКПодтверждению.СостояниеНакладной В(&СостояниеНакладной)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт_ДанныеПоНомерамЗаказовКПодтверждению.ВнешнийИдентификатор КАК ВнешнийИдентификатор
	|ИЗ
	|	вт_ДанныеПоНомерамЗаказовКПодтверждению КАК вт_ДанныеПоНомерамЗаказовКПодтверждению
	|ГДЕ
	|	вт_ДанныеПоНомерамЗаказовКПодтверждению.Документ <> НЕОПРЕДЕЛЕНО
	|	И вт_ДанныеПоНомерамЗаказовКПодтверждению.Документ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиентаFBS.ПустаяСсылка)
	|	И вт_ДанныеПоНомерамЗаказовКПодтверждению.Документ <> ЗНАЧЕНИЕ(Документ.ПредварительныйЗаказКлиента.ПустаяСсылка)
	|	И вт_ДанныеПоНомерамЗаказовКПодтверждению.КоличествоТоваров = 1");
	Запрос.УстановитьПараметр("СостояниеУКлиента",	ПараметрыОбработки.ХешТаблицаСтатусов["PROCESSING;STARTED"]);
	Запрос.УстановитьПараметр("ТекущаяДата",		ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СостояниеНакладной", МассивСостояний);
	Запрос.МенеджерВременныхТаблиц = ПараметрыОбработки.МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДополнительныеПараметры.Json = Новый Структура;
		ДополнительныеПараметры.Json.Вставить("order", Новый Структура);
		ДополнительныеПараметры.Json.order.Вставить("status", "PROCESSING");
		ДополнительныеПараметры.Json.order.Вставить("substatus", "READY_TO_SHIP");
		
		ДополнительныеПараметры.ПараметрыЗапроса.Очистить();
		СтруктураДанныхОтвета = КоннекторHTTP.Put(СтрШаблон("https://%1%2", РеквизитыМаркетПлейс.Host,
				МП_АдресЗапроса_ИзменениеСтатусаОдногоЗаказа(РеквизитыМаркетПлейс.ИДКомпании, Выборка.ВнешнийИдентификатор)),, 
			ДополнительныеПараметры);
		// Обработка ошибок со стороны сервиса
		Если Не СтруктураДанныхОтвета.Свойство("КодСостояния")
			Или СтруктураДанныхОтвета.КодСостояния > 400 Тогда
			СообщитьИзМодуля("Возникла ошибка при подтверждении заказа");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ОбработатьПодтверждениеЗаказов()

#КонецЕсли

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция - МП Параметры обработки
// Возвращает структуру параметров обработки данных сервиса Яндекс Маркет
// 
// Возвращаемое значение:
//  Структура - М п параметры обработки:
// * МаркетПлейс - СправочникСсылка.ИнетМагазины - ссылка на справочник ИнетМагазины.
// * ДатаЗапроса - Дата - Текущая дата запроса.
// * ДатаНачала - Дата - дата начала периода запроса данных сервиса.
// * ДатаОкончания - Дата - дата окончания периода запроса данных сервиса.
// * МенеджерОбъекта - ОбработкаОбъект.МП_ММ_МагнитМаркет, Неопределено - менеджер объекта обработки.
// * МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц
// * ХешТаблицаСтатусов - Соответствие из Строка - хештаблицы статусов
// * ДополнительныеПараметры - Структура - дополнительные параметры
// * ИменаСтруктурДанных - Структура - имена структур данных
// * ИменаПолей - Структура - имена полей
// * ИменаПолейТоваров - Структура - имена полей товаров
// * ПоляТовараИзДанныхЗаказа - Структура - поля товара из данных заказа
// * АгрегируемыеПоля - Структура - агрегируемые поля
// * АгрегируемыеПоляТовара - Структура - агрегируемые поля товара
// * ПолеСоответствияКодаТовара - Строка - поле соответствия кода товара в матрице
Функция МП_ПараметрыОбработки() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МаркетПлейс", Справочники.ИнетМагазины.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДатаЗапроса", ТекущаяДатаСеанса());
	СтруктураПараметров.Вставить("ДатаНачала", Дата(1, 1, 1));
	СтруктураПараметров.Вставить("ДатаОкончания", Дата(1, 1, 1));
	СтруктураПараметров.Вставить("МенеджерОбъекта", Неопределено);
	СтруктураПараметров.Вставить("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц);
	СтруктураПараметров.Вставить("ХешТаблицаСтатусов", Новый Соответствие);
	СтруктураПараметров.Вставить("ДополнительныеПараметры", Новый Структура);
	СтруктураПараметров.Вставить("ИменаСтруктурДанных", Новый Структура);
	СтруктураПараметров.Вставить("ИменаПолей", Новый Структура);
	СтруктураПараметров.Вставить("ИменаПолейТоваров", Новый Структура);
	СтруктураПараметров.Вставить("ПоляТовараИзДанныхЗаказа", Новый Структура);
	СтруктураПараметров.Вставить("АгрегируемыеПоля", Новый Структура);
	СтруктураПараметров.Вставить("АгрегируемыеПоляТовара", Новый Структура);
	// Ихсанов Д. А. Начало 25.06.2026 Изменение 0000000221 от 25.06.2026 13:13:13: e1cib/data/Документ.Изменение?ref=89690050568f680711f1707e79109a75
	СтруктураПараметров.Вставить("ПолеСоответствияКодаТовара", "");
	// Ихсанов Д. А. Конец 25.06.2026
	
	Возврат СтруктураПараметров;
	
КонецФункции // МП_ПараметрыОбработки()

// Процедура - МП Заполнить параметры обработки
// Заполняет параметры стандартными стандартными значениями текущего объекта.
// 
// Параметры:
//  СтруктураПараметров - Структура - структура параметров обработки данных сервиса Яндекс Маркет
Процедура МП_ЗаполнитьПараметрыОбработки(СтруктураПараметров) Экспорт
	
	// Общие настройки для работы в модели сервиса
	СтруктураПараметров.ДополнительныеПараметры	   = КоннекторHTTP.НовыеПараметры();
	
	// Инициализируем параметры библиотеки
	СтруктураПараметров.ДополнительныеПараметры.Заголовки =
		ОбменМаркетПлейс.МП_Яндекс_ВернутьЗаголовкиHTTP(СтруктураПараметров.МаркетПлейс);
	СтруктураПараметров.ДополнительныеПараметры.ПараметрыПреобразованияJSON.ВариантЗаписиДатыJSON =
		ВариантЗаписиДатыJSON.ЛокальнаяДата;
	СтруктураПараметров.ДополнительныеПараметры.ПараметрыПреобразованияJSON.ПрочитатьВСоответствие = Ложь;
	СтруктураПараметров.ДополнительныеПараметры.ПараметрыПреобразованияJSON.ИменаСвойствСоЗначениямиДата =
		СтрРазделить("creationDate,shipmentDate", ",");
	
	// Ихсанов Д. А. Начало 25.06.2026 Изменение 0000000221 от 25.06.2026 13:13:13: e1cib/data/Документ.Изменение?ref=89690050568f680711f1707e79109a75
	СтруктураПараметров.ПолеСоответствияКодаТовара = "ШККонтрагента";
	// Ихсанов Д. А. Конец 25.06.2026
	
	// Инициализируем параметры заполнения данных по заказу
	СтруктураПараметров.ИменаСтруктурДанных.Вставить("ТелоЗаказа", "orders");
	СтруктураПараметров.ИменаСтруктурДанных.Вставить("Товары", "items");
	
	СтруктураПараметров.ИменаПолей.Вставить("ВнешнийИдентификатор", "orderId");
	СтруктураПараметров.ИменаПолей.Вставить("ДатаСоздания", "creationDate");
	СтруктураПараметров.ИменаПолей.Вставить("ДатаОтгрузки", "ДанныеЗаказа.delivery.shipment.shipmentDate");
	
	СтруктураПараметров.ИменаПолейТоваров.Вставить("Идентификатор", "id");
	СтруктураПараметров.ИменаПолейТоваров.Вставить("ШККонтрагента", "offerId");
	
	СтруктураПараметров.ПоляТовараИзДанныхЗаказа.Вставить("ВнешнийИдентификатор",
		СтруктураПараметров.ИменаПолей["ВнешнийИдентификатор"]);
	СтруктураПараметров.ПоляТовараИзДанныхЗаказа.Вставить("Статус", "status");
	СтруктураПараметров.ПоляТовараИзДанныхЗаказа.Вставить("ДополнительныйСтатус", "substatus");
	
	СтруктураПараметров.АгрегируемыеПоля.Вставить("Сумма", 0);
	СтруктураПараметров.АгрегируемыеПоля.Вставить("ЗаказПоЮрЛицу", Ложь);
	// Ихсанов Д. А. Начало 18.06.2026 Изменение 0000000070 от 05.06.2026 10:46:32: e1cib/data/Документ.Изменение?ref=89690050568f680711f160b2a681657e
	СтруктураПараметров.АгрегируемыеПоля.Вставить("Интервал", "");
	// Ихсанов Д. А. Конец 18.06.2026
	
	СтруктураПараметров.АгрегируемыеПоляТовара.Вставить("НомерЗаказа");
	СтруктураПараметров.АгрегируемыеПоляТовара.Вставить("НомерОтгрузки");
	СтруктураПараметров.АгрегируемыеПоляТовара.Вставить("НомерПосылки");
	СтруктураПараметров.АгрегируемыеПоляТовара.Вставить("СостояниеУКлиента");
	СтруктураПараметров.АгрегируемыеПоляТовара.Вставить("ДополнительныйСтатус");
	СтруктураПараметров.АгрегируемыеПоляТовара.Вставить("ШтрихКод");
	СтруктураПараметров.АгрегируемыеПоляТовара.Вставить("Количество");
	СтруктураПараметров.АгрегируемыеПоляТовара.Вставить("Цена");
	
КонецПроцедуры // МП_ЗаполнитьПараметрыОбработки()

// Функция - МП Адрес запроса заказы
// 
// Параметры:
//  ИдентификаторКабинета - Строка - Идентификатор личного кабинета (BusinessId)
// 
// Возвращаемое значение:
//  Строка - Адрес запроса
Функция МП_АдресЗапроса_СписокЗаказов(ИдентификаторКабинета) Экспорт
	
	Возврат СтрШаблон("/v1/businesses/%1/orders", ИдентификаторКабинета);
	
КонецФункции // МП_АдресЗапроса_СписокЗаказов()

// Функция - МП Адрес запроса создать посылку
// 
// Параметры: РеквизитыМаркетПлейс - Структура - Структура с данными для составления адреса запроса
//  ИДКомпании - Строка - ИДКомпании
//  НомерЗаказа - Строка - Номер заказа
// 
// Возвращаемое значение:
//  Строка - Адрес запроса
Функция МП_АдресЗапроса_СоздатьПосылку(ИДКомпании, НомерЗаказа) Экспорт
	
	Возврат СтрШаблон("/v2/campaigns/%1/orders/%2/boxes", ИДКомпании, НомерЗаказа);
	
КонецФункции // МП_АдресЗапроса_СоздатьПосылку()

// Функция - МП Адрес запроса этикетки
// 
// Параметры: РеквизитыМаркетПлейс - Структура - Структура с данными для составления адреса запроса
//  ИДКомпании - Строка - ИДКомпании
//  НомерЗаказа - Строка - Номер заказа
//  НомерОтгрузки - Число - Номер отгрузки
//  НомерПосылки - Строка - Номер посылки
// 
// Возвращаемое значение:
//  Строка - Адрес запроса
Функция МП_АдресЗапроса_Этикетки(ИДКомпании, НомерЗаказа, НомерОтгрузки = 0, НомерПосылки) Экспорт
	
	Возврат СтрШаблон("/v2/campaigns/%1/orders/%2/delivery/shipments/%3/boxes/%4/label",
		ИДКомпании, НомерЗаказа, НомерОтгрузки, НомерПосылки);
	
КонецФункции // МП_АдресЗапроса_Этикетки()

// Функция - МП Адрес запроса подтверждение сборки
// 
// Параметры: РеквизитыМаркетПлейс - Структура - Структура с данными для составления адреса запроса
//  ИДКомпании - Строка - ИДКомпании
//  НомерЗаказа - Строка - Номер заказа
// 
// Возвращаемое значение:
//  Строка - Адрес запроса
Функция МП_АдресЗапроса_ИзменениеСтатусаОдногоЗаказа(ИДКомпании, НомерЗаказа) Экспорт
	
	Возврат СтрШаблон("/v2/campaigns/%1/orders/%2/status",
		ИДКомпании, НомерЗаказа);
	
КонецФункции // МП_АдресЗапроса_ПодтверждениеСборки()

// Функция - МП Восстановление значений полей JSON
// Вспомогательная функция, вызываемая при чтении JSON объекта. Необходима для коррекции
// типов данных и значений полей.
// 
// Параметры:
//  Свойство - Строка - Имя поля структуры JSON для обработки.
//  Значение - Строка, Число - Значения поля для обработки.
//  ДополнительныеПараметры - Структура - Перечень дополнительных параметров для обработки.
// 
// Возвращаемое значение:
//  Неопределено, Строка, Число - Строка, Число, Дата, Любая ссылка.
Функция МП_ВосстановлениеЗначенийПолейJSON(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("ИменаПолейДляВосстановления") Тогда
		Если ТипЗнч(ДополнительныеПараметры.ИменаПолейДляВосстановления) = Тип("Строка") Тогда
			МассивПолейДляВосстановления = СтрРазделить(СтрЗаменить(
				ДополнительныеПараметры.ИменаПолейДляВосстановления, " ", ""), ",", Ложь);
		Иначе
			МассивПолейДляВосстановления = ДополнительныеПараметры.ИменаПолейДляВосстановления;
		КонецЕсли;

		Если МассивПолейДляВосстановления.Найти(Свойство) = Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
		
		Результат = Неопределено;
		УстановитьБезопасныйРежим(Истина);
		Выполнить(ДополнительныеПараметры.ОбработчикПолейВосстановления[Свойство]);
		УстановитьБезопасныйРежим(Ложь);
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
	Иначе
		Результат = Неопределено;
		УстановитьБезопасныйРежим(Истина);
		Выполнить(ДополнительныеПараметры[Свойство]);
		УстановитьБезопасныйРежим(Ложь);
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // МП_ВосстановлениеЗначенийПолейJSON()

// Функция - МП Преобразование значений полей JSON
// Вспомогательная функция, вызываемая при записи JSON объекта. Необходима для коррекции
// типов данных и значений полей.
// 
// Параметры:
//  Свойство - Строка - Имя поля структуры JSON для обработки.
//  Значение - Строка, Число - Значения поля для обработки.
//  ДополнительныеПараметры - Структура - Перечень дополнительных параметров для обработки.
//  Отказ - Булево - 
// 
// Возвращаемое значение:
//  Строка, Число - Строка, Число, Дата, Любая ссылка.
Функция МП_ПреобразованиеЗначенийПолейJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	Возврат Значение;
	
КонецФункции // МП_ПреобразованиеЗначенийПолейJSON()

// Функция - Получить посылки по номерам заказов
// 
// Параметры:
//  МассивЗаказов - Массив из Строка - Массив заказов для получения данных по посылкам
//  ПараметрыОбработки - Структура - Структура параметров обработки данных сервиса Яндекс Маркет
// 
// Возвращаемое значение:
//  Соответствие Из Строка - Данные по посылкам, ключ - это номер заказа, в значении структура с данными посылки
Функция ПолучитьПосылкиПоНомерамЗаказов(МассивЗаказов, ПараметрыОбработки) Экспорт
	
	ХешКартаЗаказовИПосылок = Новый Соответствие;
	
	Для каждого ДанныеЗаказа из МассивЗаказов Цикл
		Если Не ДанныеЗаказа.delivery.Свойство("boxesLayout") Тогда
			Продолжить
		КонецЕсли;
		
		КоличествоТовара = 0;
		Для каждого ДанныеТовара из ДанныеЗаказа.items Цикл
			КоличествоТовара = КоличествоТовара + ДанныеТовара.count;
		КонецЦикла;
		
		Если КоличествоТовара <> ДанныеЗаказа.delivery.boxesLayout.Количество() Тогда
			Продолжить
		КонецЕсли;
		
		ДанныеПосылок = Новый Соответствие;
		лИндекс = ДанныеЗаказа.delivery.boxesLayout.ВГраница();
		Пока лИндекс >= 0 Цикл
			ДанныеПоЭкземпляруПосылки = ДанныеЗаказа.delivery.boxesLayout[лИндекс];
			лИндекс = лИндекс - 1;
			
			Если Не ДанныеПоЭкземпляруПосылки.Свойство("items") Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого ДанныеТовара из ДанныеПоЭкземпляруПосылки.items Цикл
				СтруктураПосылки = ДанныеПосылок[Формат(ДанныеТовара.id, "ЧГ=")];
				Если СтруктураПосылки = Неопределено Тогда
					СтруктураПосылки = Новый Соответствие;
					
					ДанныеПосылок.Вставить(Формат(ДанныеТовара.id, "ЧГ="), СтруктураПосылки);
				КонецЕсли;
				
				СтруктураТовара = Новый Структура("shipmentId");
				СтруктураТовара.Вставить("boxId",	ДанныеПоЭкземпляруПосылки.boxId);
				СтруктураТовара.Вставить("orderId", ДанныеЗаказа.orderId);
				СтруктураТовара.Вставить("barcode", ДанныеПоЭкземпляруПосылки.barcode);
				
				Если ДанныеЗаказа.delivery.shipment.Свойство("id") Тогда
					СтруктураТовара.Вставить("shipmentId", ДанныеЗаказа.delivery.shipment.id);
				КонецЕсли;
				
				СтруктураПосылки.Вставить(ДанныеПоЭкземпляруПосылки.boxId, СтруктураТовара);
			КонецЦикла;
		КонецЦикла;
		
		ХешКартаЗаказовИПосылок.Вставить(ДанныеЗаказа.orderId, ДанныеПосылок);
	КонецЦикла;
	
	Возврат ХешКартаЗаказовИПосылок;
	
КонецФункции // ПолучитьПосылкиПоНомерамЗаказов()

#КонецЕсли

#КонецОбласти
